supperthomas/rt-thread/bsp/nrf5x/nrf5340/packages/nrfx-latest/hal/nrf_radio.h
#if defined(RADIO_EDSAMPLE_EDLVL_Msk)
NRF_STATIC_INLINE uint8_t nrf_radio_ed_sample_get(NRF_RADIO_Type const * p_reg)
{
    return (uint8_t) p_reg->EDSAMPLE;
}
#endif

#if defined(RADIO_CCACTRL_CCAMODE_Msk)
NRF_STATIC_INLINE void nrf_radio_cca_configure(NRF_RADIO_Type *     p_reg,
                                               nrf_radio_cca_mode_t cca_mode,
                                               uint8_t              cca_ed_threshold,
                                               uint8_t              cca_corr_threshold,
                                               uint8_t              cca_corr_cnt)
{
    p_reg->CCACTRL = (((uint32_t)cca_mode           << RADIO_CCACTRL_CCAMODE_Pos) |
                      ((uint32_t)cca_ed_threshold   << RADIO_CCACTRL_CCAEDTHRES_Pos) |
                      ((uint32_t)cca_corr_threshold << RADIO_CCACTRL_CCACORRTHRES_Pos) |
                      ((uint32_t)cca_corr_cnt       << RADIO_CCACTRL_CCACORRCNT_Pos));
}
#endif

NRF_STATIC_INLINE void nrf_radio_power_set(NRF_RADIO_Type * p_reg, bool radio_power)
{
    p_reg->POWER = (radio_power ? RADIO_POWER_POWER_Enabled : RADIO_POWER_POWER_Disabled)
                   << RADIO_POWER_POWER_Pos;
}

#if defined(RADIO_CTESTATUS_CTETIME_Msk)
NRF_STATIC_INLINE uint32_t nrf_radio_cte_time_get(NRF_RADIO_Type const * p_reg)
{
    return ((p_reg->CTESTATUS & RADIO_CTESTATUS_CTETIME_Msk) >> RADIO_CTESTATUS_CTETIME_Pos);
}

NRF_STATIC_INLINE uint32_t nrf_radio_cte_type_get(NRF_RADIO_Type const * p_reg)
{
    return ((p_reg->CTESTATUS & RADIO_CTESTATUS_CTETYPE_Msk) >> RADIO_CTESTATUS_CTETYPE_Pos);
}

NRF_STATIC_INLINE uint32_t nrf_radio_cte_rfu_get(NRF_RADIO_Type const * p_reg)
{
    return ((p_reg->CTESTATUS & RADIO_CTESTATUS_RFU_Msk) >> RADIO_CTESTATUS_RFU_Pos);
}
#endif

#if defined(RADIO_DFESTATUS_SWITCHINGSTATE_Msk)
NRF_STATIC_INLINE
nrf_radio_dfe_switch_state_t nrf_radio_dfe_switch_state_get(NRF_RADIO_Type const * p_reg)
{
    return (nrf_radio_dfe_switch_state_t)((p_reg->DFESTATUS & RADIO_DFESTATUS_SWITCHINGSTATE_Msk) >>
                                          RADIO_DFESTATUS_SWITCHINGSTATE_Pos);
}

NRF_STATIC_INLINE
nrf_radio_dfe_sample_state_t nrf_radio_dfe_sample_state_get(NRF_RADIO_Type const * p_reg)
{
    return (nrf_radio_dfe_sample_state_t)((p_reg->DFESTATUS & RADIO_DFESTATUS_SAMPLINGSTATE_Msk) >>
                                          RADIO_DFESTATUS_SAMPLINGSTATE_Pos);
}
#endif

#if defined(RADIO_CTEINLINECONF_S0CONF_Msk)
NRF_STATIC_INLINE void nrf_radio_cteinline_configure(NRF_RADIO_Type *                   p_reg,
                                                     nrf_radio_cteinline_conf_t const * p_config)
{
    p_reg->CTEINLINECONF = (((p_config->enable ?
                                  RADIO_CTEINLINECONF_CTEINLINECTRLEN_Enabled :
                                  RADIO_CTEINLINECONF_CTEINLINECTRLEN_Disabled) <<
                                  RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos ) |
                            ((p_config->info_in_s1 ?
                                  RADIO_CTEINLINECONF_CTEINFOINS1_InS1 :
                                  RADIO_CTEINLINECONF_CTEINFOINS1_NotInS1) <<
                                  RADIO_CTEINLINECONF_CTEINFOINS1_Pos ) |
                            ((p_config->err_handling ?
                                  RADIO_CTEINLINECONF_CTEERRORHANDLING_Yes :
                                  RADIO_CTEINLINECONF_CTEERRORHANDLING_No) <<
                                  RADIO_CTEINLINECONF_CTEERRORHANDLING_Pos ) |
                            ((uint32_t)p_config->time_range <<
                                 RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Pos) |
                            ((uint32_t)p_config->rx1us <<
                                 RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Pos) |
                            ((uint32_t)p_config->rx2us <<
                                 RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) |
                            ((uint32_t)p_config->s0_pattern << RADIO_CTEINLINECONF_S0CONF_Pos) |
                            ((uint32_t)p_config->s0_mask << RADIO_CTEINLINECONF_S0MASK_Pos));
}
#endif

#if defined(RADIO_DFECTRL1_NUMBEROF8US_Msk)
NRF_STATIC_INLINE void nrf_radio_dfectrl_configure(NRF_RADIO_Type *                 p_reg,
                                                   nrf_radio_dfectrl_conf_t const * p_config)
{
    p_reg->DFECTRL1 = ((((uint32_t)p_config->dfe_len << RADIO_DFECTRL1_NUMBEROF8US_Pos) &
                            RADIO_DFECTRL1_NUMBEROF8US_Msk) |
                       ((uint32_t)p_config->extension << RADIO_DFECTRL1_DFEINEXTENSION_Pos) |
                       ((uint32_t)p_config->switch_spacing << RADIO_DFECTRL1_TSWITCHSPACING_Pos) |
                       ((uint32_t)p_config->spacing_ref << RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos) |
                       ((uint32_t)p_config->sample_type << RADIO_DFECTRL1_SAMPLETYPE_Pos) |
                       ((uint32_t)p_config->sample_spacing << RADIO_DFECTRL1_TSAMPLESPACING_Pos) |
                       (((uint32_t)p_config->gain_steps << RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos) &
                            RADIO_DFECTRL1_AGCBACKOFFGAIN_Msk));

    p_reg->DFECTRL2 = ((((uint32_t)p_config->switch_offset << RADIO_DFECTRL2_TSWITCHOFFSET_Pos) &
                            RADIO_DFECTRL2_TSWITCHOFFSET_Msk) |
                       (((uint32_t)p_config->sample_offset << RADIO_DFECTRL2_TSAMPLEOFFSET_Pos) &
                            RADIO_DFECTRL2_TSAMPLEOFFSET_Msk));
}
#endif

#if defined(RADIO_SWITCHPATTERN_SWITCHPATTERN_Msk)
NRF_STATIC_INLINE void nrf_radio_dfe_pattern_pin_set(NRF_RADIO_Type * p_reg,
                                                     uint32_t         pin,
                                                     uint8_t          pos)
{
    p_reg->PSEL.DFEGPIO[pos] = pin;
}

NRF_STATIC_INLINE void nrf_radio_dfe_pattern_add(NRF_RADIO_Type * p_reg, uint8_t pin_mask)
{
    p_reg->SWITCHPATTERN = (uint32_t)pin_mask;
}

NRF_STATIC_INLINE void nrf_radio_dfe_patterns_add(NRF_RADIO_Type * p_reg,
                                                  uint8_t const *  p_pin_masks,
                                                  size_t           length)
{
    for (size_t i = 0; i < length; i++)
    {
        nrf_radio_dfe_pattern_add(p_reg, p_pin_masks[i]);
    }
}

NRF_STATIC_INLINE uint32_t nrf_radio_dfe_pattern_cnt_get(NRF_RADIO_Type const * p_reg)
{
    return p_reg->SWITCHPATTERN;
}

NRF_STATIC_INLINE void nrf_radio_dfe_pattern_clear(NRF_RADIO_Type * p_reg)
{
    p_reg->CLEARPATTERN = RADIO_CLEARPATTERN_CLEARPATTERN_Clear <<
                          RADIO_CLEARPATTERN_CLEARPATTERN_Pos;
}
#endif

#if defined(RADIO_DFEPACKET_PTR_PTR_Msk)
NRF_STATIC_INLINE void nrf_radio_dfe_buffer_set(NRF_RADIO_Type * p_reg,
                                                uint32_t *       p_buffer,
                                                size_t           length)
{
    p_reg->DFEPACKET.PTR    = (uint32_t)p_buffer;
    p_reg->DFEPACKET.MAXCNT = length;
}

NRF_STATIC_INLINE uint32_t nrf_radio_dfe_amount_get(NRF_RADIO_Type const * p_reg)
{
    return p_reg->DFEPACKET.AMOUNT;
}
#endif

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_RADIO_H__
